УТ_для_edt/src/Documents/смартIECHOСпецификация/смартIECHOСпецификация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартIECHOСпецификация</name>
  <comment>//смарт:ММ #092 389 06.01.2021</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОборудования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <comment>// 17.01.2021</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаНаЗакупку</name>
    <comment>// 17.01.2021</comment>
    <type>
      <types>CatalogRef.смартIECHOСкидкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоДляКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Маржа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДействияКП</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставкиДней</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиДоГраницыРФ</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьТаможенногоОформления</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиПоРФ</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СебестоимостьОборудования</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоДляКлиентаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоЦенаЗакупкиСоСкидкой</name>
    <comment>// 12.05.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаржаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рентабельность</name>
    <comment>#1326 смарт: Лопато 20.03.2023 //Расчет маржи в спецификациях iECHO</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиЖДТранспортом</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиАМТранспортом</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчета</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаЗаполненияСтоимости</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>CatalogRef.смартiECHOЗаполнениеСтоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.смартТипыДоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>НаименованиеКомплектующей</name>
      <type>
        <types>CatalogRef.смартIECHOКомплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Catalogs/смартIECHOКомплектующие/смартIECHOКомплектующие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартIECHOКомплектующие</name>
  <comment>//смарт:ММ #092 389 06.01.2021</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УточнениеВНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьУточнениеВСпецификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Важно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.смартIECHOКомплектующиеПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКомплектующая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеИспользованияПоМоделям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Model</name>
    <type>
      <types>EnumRef.смартIECHOМоделиКомплектующих</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <comment>Тип модели на английском</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеИспользованияПоРазмеру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентРасчетаСебестоимости</name>
    <comment>// 16.05.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючеваяКомплектующая</name>
    <comment>//++ #Б1252 смарт: Шляпников 12.11.2024 / Создание Заказа клиента из Спецификации IECHO</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КабельВКомплекте</name>
    <comment>//++ #Б1252 смарт: Шляпников 12.11.2024 / Создание Заказа клиента из Спецификации IECHO</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МоделиДляИспользования</name>
    <attributes>
      <name>Модель</name>
      <type>
        <types>EnumRef.смартIECHOМоделиКомплектующих</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмерыДляИспользования</name>
    <attributes>
      <name>Размер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартIECHOСпецификация/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Документ.смартIECHOСпецификация";
	//КомандаПечати.Идентификатор = "ПредзаказИностранномуПоставщику";
	//КомандаПечати.Представление = НСтр("ru = 'Предзаказ поставщику'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.ДополнительныеПараметры.Вставить("Тип", "ПредзаказИностранномуПоставщику");

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры


#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ЗаказКлиента.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Заказ клиента".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаказКлиента) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаказКлиента.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ЗаказКлиента);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьЗаказыКлиентов";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

#КонецОбласти

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//++ смарт:ММ #101 409 13.04.2021 Обновление 11.4.13.155
	// Найти, чем заменить!!!
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	// --
		
КонецПроцедуры

// ++ 16.05.2021
Функция ПолучитьКоэффициентРасчетаСС(ТЧ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.НаименованиеКомплектующей КАК НаименованиеКомплектующей
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
	|	смартIECHOКомплектующиеСпр.КоэффициентРасчетаСебестоимости КАК КоэффициентРасчетаСебестоимости
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.смартIECHOКомплектующие КАК смартIECHOКомплектующиеСпр
	|		ПО ВТ_ТЧ.НаименованиеКомплектующей = смартIECHOКомплектующиеСпр.Ссылка
	|ГДЕ
	|	смартIECHOКомплектующиеСпр.ОсновнаяКомплектующая";
	
	Запрос.УстановитьПараметр("ТЧ", ТЧ);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	//++ #1361 смарт: Фролов 30.05.2023 //Изменения в модуле iECHO  
	//Если Выборка.Следующий() Тогда
	//	Возврат Выборка.КоэффициентРасчетаСебестоимости;
	//КонецЕсли; 
	
	//Возврат 1;
	КоэффициентРасчетаСебестоимости=0;
	Пока Выборка.Следующий() Цикл
		КоэффициентРасчетаСебестоимости=КоэффициентРасчетаСебестоимости+Выборка.КоэффициентРасчетаСебестоимости;
	КонецЦикла;
	Если КоэффициентРасчетаСебестоимости=0 Тогда
		Возврат 1;
	Иначе
		Возврат КоэффициентРасчетаСебестоимости;
	КонецЕсли;	
	//-- #1361 смарт: Фролов 30.05.2023
	
КонецФункции

#КонецЕсли
